private/api/stripe/processStripeWebhook/fixtures/customer.json

{
  "id": "cus_9bniY1HrZ70UAX",
  "object": "customer",
  "account_balance": 0,
  "created": 1479805103,
  "currency": "eur",
  "default_source": "card_19Ia6YHWQi1QKLvWpN9IH3Mk",
  "delinquent": false,
  "description": null,
  "discount": null,
  "email": "ivana.t.veljovic@gmail.com",
  "livemode": false,
  "metadata": {
     "referredOf": "WQi1QKLvWpN9IH3Mk"
  },
  "shipping": null,
  "sources": {
    "object": "list",
    "data": [
      {
        "id": "card_19Ia6YHWQi1QKLvWpN9IH3Mk",
        "object": "card",
        "address_city": null,
        "address_country": null,
        "address_line1": null,
        "address_line1_check": null,
        "address_line2": null,
        "address_state": null,
        "address_zip": null,
        "address_zip_check": null,
        "brand": "Visa",
        "country": "US",
        "customer": "cus_9bniY1HrZ70UAX",
        "cvc_check": "pass",
        "dynamic_last4": null,
        "exp_month": 1,
        "exp_year": 2018,
        "funding": "credit",
        "last4": "4242",
        "metadata": {
        },
        "name": "Ivana Veljovic",
        "tokenization_method": null
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/customers/cus_9bniY1HrZ70UAX/sources"
  }
}